{
    "name": "Spring Festival",
    "conditions": "winter 28/900 2400",
    "set-up": "Town 29 66 down/Lewis 33 66 2/Pierre 37 63 2/Caroline 38 63 0/Abigail 39 64 2/Alex 26 64 0/Haley 27 64 2/Sam 30 71 2/Sebastian 25 62 2/Penny 35 69 0/Maru 40 66 0/Harvey 41 66 2/Shane 43 71 2/Emily 34 63 0/Jodi 28 69 0/Evelyn 31 73 0/George 30 73 2/Clint 43 65 2/Demetrius 39 69 0/Robin 27 67 2/Willy 44 70 0/Pam 43 72 2/Linus 23 61 2/Elliott 37 71 2/Leah 36 71 0/Jas 32 73 2/Vincent 33 73 0/Marnie 31 72 2/Gus 38 73 0/Kent 28 69 2/Wizard 23 71 0",
    "mainEvent": "pause 300/speak Lewis \"Welcome, everyone! Tonight we celebrate the Spring Festival — a time of renewal and hope!\"/pause 500/emote Lewis 56/pause 300/speak Lewis \"As winter draws to a close, we come together to welcome a brand new year!\"/pause 300/jump Lewis/pause 500/speak Lewis \"Now... let us light the fireworks!\"/pause 500/playSound drumkit6/pause 300/playSound drumkit6/pause 200/playSound drumkit6/pause 600/playSound explosion/screenFlash 0.8/pause 400/playSound explosion/screenFlash 0.8/pause 300/playSound explosion/screenFlash 0.8/pause 500/playSound explosion/screenFlash 0.8/pause 200/playSound explosion/screenFlash 0.8/pause 400/playSound explosion/screenFlash 0.8/pause 300/playSound explosion/screenFlash 0.8/pause 600/playSound explosion/screenFlash 0.8/pause 300/speak Lewis \"Happy New Year! May the coming year bring prosperity and happiness to us all!\"/pause 300/emote Lewis 56/emote farmer 56/pause 500/end",

    "Lewis": "Welcome to the Spring Festival! I hope everyone enjoys our celebration tonight!$h",
    "Pierre": "I've set up a special booth for the festival! Come take a look at the festive goods!$h",
    "Caroline": "The red decorations are so beautiful! They symbolize good fortune and joy.$h",
    "Abigail": "I heard there will be fireworks tonight! I can't wait — fireworks are the best!$h",
    "Alex": "A Spring Festival, huh? Sounds awesome! Is there good food here?$h",
    "Haley": "Red isn't really my color, but I have to admit these decorations are gorgeous!$h",
    "Sam": "Dude, fireworks tonight! This is going to be epic!$h",
    "Sebastian": "...The fireworks should be pretty cool, I guess.$s",
    "Penny": "I've been teaching Jas and Vincent about different cultural celebrations. The Spring Festival is so rich in history!$h",
    "Maru": "I've been researching the chemistry behind fireworks. Different metal salts create different colors — it's fascinating!$h",
    "Harvey": "Remember to dress warmly tonight! It's still the middle of winter, after all.$h",
    "Shane": "Free food and drinks? ...I'm not complaining.$s",
    "Emily": "I made a special outfit for tonight! Red is such a powerful, vibrant color — it radiates energy!$h",
    "Jodi": "What a wonderful festival! It's so nice to see the whole town celebrating together.$h",
    "Kent": "Celebrations like this... they remind you to appreciate what you have.$s",
    "Evelyn": "This reminds me of celebrations from my youth... every festival felt truly magical back then.$h",
    "George": "Hmph. At least the food smells good. Don't expect me to dance, though.$s",
    "Clint": "These red lanterns... the warm glow reminds me of my forge. Beautiful in a different way.$s",
    "Demetrius": "Did you know the Spring Festival tradition stretches back over 4,000 years? Absolutely fascinating!$h",
    "Robin": "I helped build the festival stage this year! Not bad, right?$h",
    "Willy": "In all my years at sea, I've seen celebrations the world over. This one's somethin' special.$h",
    "Pam": "NOW this is what I call a festival! Great food, great drinks, great company!$h",
    "Linus": "The fireworks look beautiful from the mountainside... nature's own light show.$h",
    "Elliott": "What a magnificent celebration! The vibrant colors and festive atmosphere are truly inspiring for my writing!$h",
    "Leah": "The artistry in these decorations is incredible. I might use them as inspiration for my next sculpture!$h",
    "Jas": "Look at all the pretty lanterns! Can I take one home? Please?$h",
    "Vincent": "Mommy says we can stay up late for the fireworks! Yaaay!$h",
    "Marnie": "Even the animals seem excited tonight! I think they can sense the festive energy in the air.$h",
    "Gus": "I've prepared special dumplings and longevity noodles for tonight! Come try some at my stall!$h",
    "Wizard": "The magical energy is powerful tonight... the turning of the year stirs ancient forces.$h",
    "Sandy": "It's so wonderful to visit the valley for a celebration like this! The desert never has festivals.$h"
}
