{
    "name": "Spring Festival",
    "conditions": "Town/1800 2400",
    "startedMessage": "Welcome to the Spring Festival! Talk to the townsfolk and enjoy the evening! When you're ready, find the Mayor to start the celebration.",

    "set-up": "event2/-1000 -1000/farmer 29 66 2/changeToTemporaryMap Town/viewport -1000 -1000/loadActors Set-Up/viewport 29 66/playerControl spring_festival",
    "Set-Up_additionalCharacters": "Lewis 33 66 2/Pierre 25 72 2 pierre_shop/Emily 31 72 2/Caroline 30 74 0/Jodi 31 74 2/Abigail 42 58 0/Sam 43 58 2/Sebastian 44 60 2/Alex 27 68 0/Haley 28 68 2/Penny 37 73 2/Jas 38 74 0/Vincent 39 74 0/Maru 40 66 0/Harvey 41 66 2/Demetrius 39 68 0/Robin 38 68 2/Shane 26 70 2/Marnie 27 70 0/Evelyn 34 74 0 sitting/George 35 74 2 sitting/Clint 44 64 2/Willy 40 72 2/Pam 41 72 0/Gus 42 72 2/Linus 25 57 2/Elliott 35 71 2/Leah 36 71 0",

    "mainEvent": "continue/-1000 -1000/pause 300/speak Lewis \"Welcome, everyone, to our annual Spring Festival celebration!\"/pause 300/emote Lewis 56/pause 300/speak Lewis \"As we gather on this special night, let us welcome the arrival of a brand new year!\"/pause 500/speak Lewis \"Winter is coming to an end, and spring awaits. Let us embrace the future with hope!\"/pause 300/speak Lewis \"Now... it's time to light the fireworks!\"/pause 500/playSound drumkit6/pause 400/playSound drumkit6/pause 300/playSound drumkit6/pause 600/screenFlash 0.8/playSound firework/pause 800/screenFlash 0.6/playSound firework/pause 600/screenFlash 0.9/playSound firework/pause 400/screenFlash 0.7/playSound firework/pause 500/screenFlash 0.8/playSound firework/pause 300/screenFlash 0.6/playSound firework/pause 600/screenFlash 0.9/playSound firework/pause 400/screenFlash 0.7/playSound firework/pause 300/screenFlash 0.8/playSound firework/pause 500/screenFlash 0.9/playSound firework/pause 600/speak Lewis \"Happy New Year! May the coming year bring prosperity and happiness to us all!\"/pause 300/emote Lewis 56/pause 500/end",

    "Lewis": "Welcome to the Spring Festival! Are you ready for the new year? Come find me when you're done exploring and we'll light the fireworks together!$h#$b#Ready to start the fireworks show?$h",
    "Pierre": "Welcome to the festival market! I've prepared special goods for this occasion!$h",
    "Caroline": "These red decorations are so beautiful! They symbolize good fortune and joy.$h",
    "Abigail": "I heard there will be fireworks tonight! I can't wait!$h",
    "Alex": "A Spring Festival, huh? Sounds awesome! Is there good food here?$h",
    "Haley": "Red isn't really my color, but these decorations are gorgeous!$h",
    "Sam": "Dude, fireworks tonight! This is going to be epic!$h",
    "Sebastian": "...The fireworks should be pretty cool, I guess.$s",
    "Penny": "I've been teaching Jas and Vincent about the Spring Festival traditions!$h",
    "Maru": "I've been researching the chemistry behind fireworks — fascinating!$h",
    "Harvey": "Remember to dress warmly tonight! It's still winter, after all.$h",
    "Shane": "Free food and drinks? ...I'm not complaining.$s",
    "Emily": "I made a special outfit for tonight! Red radiates such energy!$h",
    "Jodi": "What a wonderful festival! It's so nice seeing everyone together.$h",
    "Kent": "Celebrations like this... they remind you to appreciate what you have.$s",
    "Evelyn": "This reminds me of celebrations from my youth... magical times.$h",
    "George": "Hmph. At least the food smells good. Don't expect me to dance.$s",
    "Clint": "These red lanterns... the warm glow reminds me of my forge.$s",
    "Demetrius": "Did you know the Spring Festival stretches back over 4,000 years?$h",
    "Robin": "I helped build the festival stage this year! Not bad, right?$h",
    "Willy": "In all my years at sea, I've seen many celebrations. This one's special.$h",
    "Pam": "NOW this is a festival! Great food, drinks, and company!$h",
    "Linus": "The fireworks look beautiful from the mountainside...$h",
    "Elliott": "What a magnificent celebration! Truly inspiring for my writing!$h",
    "Leah": "The artistry in these decorations is incredible!$h",
    "Jas": "Look at all the pretty lanterns! Can I take one home?$h",
    "Vincent": "Mommy says we can stay up late for the fireworks! Yaaay!$h",
    "Marnie": "Even the animals seem excited tonight!$h",
    "Gus": "I've prepared special dumplings and noodles! Come try some!$h",
    "Wizard": "The magical energy is powerful tonight... ancient forces stir.$h",
    "Sandy": "It's so wonderful to visit for a celebration like this!$h"
}
